In [1]:
import pandas as pd

In [11]:
df1=pd.read_csv(r"C:\Users\razih\OneDrive\Desktop\New\electronics\Customers.csv",encoding='latin1')
df2=pd.read_csv(r"C:\Users\razih\OneDrive\Desktop\New\electronics\Products.csv",encoding='latin1')
df3=pd.read_csv(r"C:\Users\razih\OneDrive\Desktop\New\electronics\Sales.csv",encoding='latin1')
df4=pd.read_csv(r"C:\Users\razih\OneDrive\Desktop\New\electronics\Stores.csv",encoding='latin1')
df5=pd.read_csv(r"C:\Users\razih\OneDrive\Desktop\New\electronics\Exchange_Rates.csv",encoding='latin1')

In [12]:
df1.head(2)

,CustomerKey,Gender,Name,City,State Code,State,Zip Code,Country,Continent,Birthday
0,301,Female,Lilly Harding,WANDEARAH EAST,SA,South Australia,5523,Australia,Australia,7/3/1939
1,325,Female,Madison Hull,MOUNT BUDD,WA,Western Australia,6522,Australia,Australia,9/27/1979

In [13]:
df1.isna().sum()

CustomerKey     0
Gender          0
Name            0
City            0
State Code     10
State           0
Zip Code        0
Country         0
Continent       0
Birthday        0
dtype: int64

In [14]:
df1.dropna(inplace=True)

In [15]:
df1['Birthday']=pd.to_datetime(df1['Birthday'])
df1.head(2)

,CustomerKey,Gender,Name,City,State Code,State,Zip Code,Country,Continent,Birthday
0,301,Female,Lilly Harding,WANDEARAH EAST,SA,South Australia,5523,Australia,Australia,1939-07-03
1,325,Female,Madison Hull,MOUNT BUDD,WA,Western Australia,6522,Australia,Australia,1979-09-27

In [56]:
# Get the current date
today = pd.Timestamp.today()

# Calculate the age
df1['age'] = df1['Birthday'].apply(lambda b: today.year - b.year - ((today.month, today.day) < (b.month, b.day)))

In [57]:
df1.head(1)

,CustomerKey,Gender,Name,City,State Code,State,Zip Code,Country,Continent,Birthday,age
0,301,Female,Lilly Harding,WANDEARAH EAST,SA,South Australia,5523,Australia,Australia,1939-07-03,85

In [58]:
df1.to_csv("cus.csv")

In [18]:
df2.head(2)

,ProductKey,Product Name,Brand,Color,Unit Cost USD,Unit Price USD,SubcategoryKey,Subcategory,CategoryKey,Category
0,1,Contoso 512MB MP3 Player E51 Silver,Contoso,Silver,$6.62,$12.99,101,MP4&MP3,1,Audio
1,2,Contoso 512MB MP3 Player E51 Blue,Contoso,Blue,$6.62,$12.99,101,MP4&MP3,1,Audio

In [19]:
df2.shape

(2517, 10)

In [20]:
# chaging its dtype and replacing few strings

df2['Unit Cost USD'] = pd.to_numeric(df2['Unit Cost USD'].str.replace('$', '').str.replace(',', ''), errors='coerce')
df2['Unit Price USD'] = pd.to_numeric(df2['Unit Price USD'].str.replace('$', '').str.replace(',', ''), errors='coerce')
df2.head(2)

,ProductKey,Product Name,Brand,Color,Unit Cost USD,Unit Price USD,SubcategoryKey,Subcategory,CategoryKey,Category
0,1,Contoso 512MB MP3 Player E51 Silver,Contoso,Silver,6.62,12.99,101,MP4&MP3,1,Audio
1,2,Contoso 512MB MP3 Player E51 Blue,Contoso,Blue,6.62,12.99,101,MP4&MP3,1,Audio

In [21]:
df2.isna().sum()

ProductKey        0
Product Name      0
Brand             0
Color             0
Unit Cost USD     0
Unit Price USD    0
SubcategoryKey    0
Subcategory       0
CategoryKey       0
Category          0
dtype: int64

In [22]:
df2.to_csv("pro.csv")

In [23]:
df3.head(2)

,Order Number,Line Item,Order Date,Delivery Date,CustomerKey,StoreKey,ProductKey,Quantity,Currency Code
0,366000,1,1/1/2016,NaN,265598,10,1304,1,CAD
1,366001,1,1/1/2016,1/13/2016,1269051,0,1048,2,USD

In [24]:
df3.shape

(62884, 9)

In [25]:
df3.isna().sum()

Order Number         0
Line Item            0
Order Date           0
Delivery Date    49719
CustomerKey          0
StoreKey             0
ProductKey           0
Quantity             0
Currency Code        0
dtype: int64

In [26]:
df3.drop(['Delivery Date'],axis=1,inplace=True)

In [27]:
df3.head(1)

,Order Number,Line Item,Order Date,CustomerKey,StoreKey,ProductKey,Quantity,Currency Code
0,366000,1,1/1/2016,265598,10,1304,1,CAD

In [28]:
df3['Order Date']=pd.to_datetime(df3['Order Date'])
df3.head(2)

,Order Number,Line Item,Order Date,CustomerKey,StoreKey,ProductKey,Quantity,Currency Code
0,366000,1,2016-01-01,265598,10,1304,1,CAD
1,366001,1,2016-01-01,1269051,0,1048,2,USD

In [30]:
df3.shape

(62884, 8)

In [31]:
df3.to_csv("sale.csv")

In [32]:
df4.head(2)

   StoreKey    Country                         State  Square Meters  Open Date
0         1  Australia  Australian Capital Territory          595.0   1/1/2008
1         2  Australia            Northern Territory          665.0  1/12/2008

In [33]:
df4.isna().sum()

StoreKey         0
Country          0
State            0
Square Meters    1
Open Date        0
dtype: int64

In [34]:
df4.dropna(inplace=True)

In [35]:
df4['Open Date']=pd.to_datetime(df4['Open Date'])
df4.head(2)

   StoreKey    Country                         State  Square Meters  Open Date
0         1  Australia  Australian Capital Territory          595.0 2008-01-01
1         2  Australia            Northern Territory          665.0 2008-01-12

In [36]:
df4.shape

(66, 5)

In [37]:
df4.to_csv("store.csv")

In [40]:
df5.head(2)

       Date Currency  Exchange
0  1/1/2015      USD    1.0000
1  1/1/2015      CAD    1.1583

In [41]:
df5['Date']=pd.to_datetime(df5['Date'])
#ex.head(2)

df5=df5.rename(columns={'Date': 'Record_Date'})# Rename a single column
df5.head(2)

  Record_Date Currency  Exchange
0  2015-01-01      USD    1.0000
1  2015-01-01      CAD    1.1583

In [42]:
df5.shape

(11215, 3)

In [43]:
df5.to_csv("ex.csv")

# merging data frames by commmon columns

In [60]:
cus_df=pd.read_csv(r"C:\Users\razih\OneDrive\Desktop\New\electronics\cus.csv")
cus_df=cus_df.drop(['Unnamed: 0'],axis=1)
cus_df.head(2)
#cus_df.shape

,CustomerKey,Gender,Name,City,State Code,State,Zip Code,Country,Continent,Birthday,age
0,301,Female,Lilly Harding,WANDEARAH EAST,SA,South Australia,5523,Australia,Australia,1939-07-03,85
1,325,Female,Madison Hull,MOUNT BUDD,WA,Western Australia,6522,Australia,Australia,1979-09-27,45

In [61]:
sale_df=pd.read_csv(r"C:\Users\razih\OneDrive\Desktop\New\electronics\sale.csv")
sale_df=sale_df.drop(['Unnamed: 0'],axis=1)
sale_df.head(2)
#sale_df.shape

,Order Number,Line Item,Order Date,CustomerKey,StoreKey,ProductKey,Quantity,Currency Code
0,366000,1,2016-01-01,265598,10,1304,1,CAD
1,366001,1,2016-01-01,1269051,0,1048,2,USD

In [63]:
sale_cus=pd.merge(sale_df,cus_df, on='CustomerKey',how='left')
sale_cus.head(2)

,Order Number,Line Item,Order Date,CustomerKey,StoreKey,ProductKey,Quantity,Currency Code,Gender,Name,City,State Code,State,Zip Code,Country,Continent,Birthday,age
0,366000,1,2016-01-01,265598,10,1304,1,CAD,Male,Tyler Vaught,London,ON,Ontario,N5W 5K6,Canada,North America,1971-03-23,53.0
1,366001,1,2016-01-01,1269051,0,1048,2,USD,Male,Frank Upchurch,Auberry,CA,California,93602,United States,North America,1995-11-20,29.0

In [64]:
pro_df = pd.read_csv(r"C:\Users\razih\OneDrive\Desktop\New\electronics\pro.csv")
pro_df.drop(['Unnamed: 0'],axis=1,inplace=True)
pro_df.head(2)
#pro_df.shape

,ProductKey,Product Name,Brand,Color,Unit Cost USD,Unit Price USD,SubcategoryKey,Subcategory,CategoryKey,Category
0,1,Contoso 512MB MP3 Player E51 Silver,Contoso,Silver,6.62,12.99,101,MP4&MP3,1,Audio
1,2,Contoso 512MB MP3 Player E51 Blue,Contoso,Blue,6.62,12.99,101,MP4&MP3,1,Audio

In [65]:
sale_cus_pro=pd.merge(sale_cus,pro_df,on='ProductKey', how='left')
sale_cus_pro.head(2)

,Order Number,Line Item,Order Date,CustomerKey,StoreKey,ProductKey,Quantity,Currency Code,Gender,Name,...,age,Product Name,Brand,Color,Unit Cost USD,Unit Price USD,SubcategoryKey,Subcategory,CategoryKey,Category
0,366000,1,2016-01-01,265598,10,1304,1,CAD,Male,Tyler Vaught,...,53.0,Contoso Lens Adapter M450 White,Contoso,White,31.27,68.0,406,Cameras & Camcorders Accessories,4,Cameras and camcorders
1,366001,1,2016-01-01,1269051,0,1048,2,USD,Male,Frank Upchurch,...,29.0,A. Datum SLR Camera X136 Silver,A. Datum,Silver,141.47,427.0,402,Digital SLR Cameras,4,Cameras and camcorders

In [66]:
sale_cus_pro.shape

(62884, 27)

In [67]:
import pymysql

connection=pymysql.connect(
    host='localhost',
    user='root',
    password='123456789',
    database='dataspark'
)
cursor=connection.cursor()

In [71]:
query="drop table customer"
cursor.execute(query)
query="show tables"
cursor.execute(query)
for i in cursor:
    print(i)

('exchange_rate',)
('product',)
('sale',)
('sales_customer_product_store',)
('store',)

In [72]:
# Creating Table Customers
cursor.execute('''CREATE TABLE Customer(
        ID INT AUTO_INCREMENT PRIMARY KEY,
        CustomerKey INT,
        Gender VARCHAR(25) NOT NULL ,
        Customer_Name VARCHAR(50) NOT NULL,
        City VARCHAR(50) NOT NULL,
        State_Code VARCHAR(50) NOT NULL,
        State VARCHAR(50) NOT NULL,
        Zip_Code VARCHAR(10) NOT NULL,
        Country VARCHAR(50) NOT NULL,
        Continent VARCHAR(50) NOT NULL,
        Birthday VARCHAR(50) NOT NULL,
        Age INT 
    )''')
print("Table Created successfully")

Table Created successfully

In [ ]:
# Inserting data into Customer table
insert_query = '''INSERT INTO Customer(
                    CustomerKey,
                    Gender,
                    Customer_Name,
                    City,
                    State_Code,
                    State,
                    Zip_Code,
                    Country,
                    Continent,
                    Birthday,
                    Age
                    )
                  VALUES(%s, %s, %s, %s, %s, %s, %s, %s, %s, %s, %s)'''
data = cus_df.values.tolist()
cursor.executemany(insert_query, data)
connection.commit()

print("Values inserted successfully")

Values inserted successfully

In [74]:
# Creating Table Sales
cursor.execute('''CREATE TABLE if not exists Sale(
        ID INT AUTO_INCREMENT PRIMARY KEY,
        Order_Number INT,
        Line_Item INT,
        Order_Date VARCHAR(50) NOT NULL,
        CustomerKey INT,
        StoreKey INT,
        ProductKey INT,
        Quantity INT,
        Currency_Code VARCHAR(50) NOT NULL
    )''')
print("Table Created successfully")

Table Created successfully

In [ ]:
# Inserting data into Sales table
insert_query = '''INSERT INTO Sale(
            Order_Number,
            Line_Item,
            Order_Date,
            CustomerKey,
            StoreKey,
            ProductKey,
            Quantity,
            Currency_Code
            )
        VALUES(%s, %s, %s, %s, %s, %s, %s, %s)'''
data = sale_df.values.tolist()

cursor.executemany(insert_query, data)

connection.commit()

print("Values inserted successfully")

In [75]:
# Creating Table Product
cursor.execute('''CREATE TABLE if not exists Product(
        ID INT AUTO_INCREMENT PRIMARY KEY,
        ProductKey INT,
        Product_Name VARCHAR(150) NOT NULL,
        Brand VARCHAR(50) NOT NULL,
        Color VARCHAR(50) NOT NULL,
        Unit_Cost_USD FLOAT,
        Unit_Price_USD FLOAT,
        SubcategoryKey INT,
        Subcategory VARCHAR(50) NOT NULL,
        CategoryKey INT,
        Category VARCHAR(50) NOT NULL
    )''')
print("Table Created successfully")

Table Created successfully

In [ ]:
# Inserting data into Product table
insert_query = '''INSERT INTO Product(
            ProductKey,
            Product_Name,
            Brand,
            Color,
            Unit_Cost_USD,
            Unit_Price_USD,
            SubcategoryKey,
            Subcategory,
            CategoryKey,
            Category
            )
        VALUES(%s, %s, %s, %s, %s, %s, %s, %s, %s, %s)'''
data = pro_df.values.tolist()

cursor.executemany(insert_query, data)

connection.commit()

print("Values inserted successfully")

In [76]:
# Creating Table Stores
cursor.execute('''CREATE TABLE if not exists Store(
        ID INT AUTO_INCREMENT PRIMARY KEY,
        StoreKey INT,
        Country VARCHAR(50) NOT NULL,
        State VARCHAR(50) NOT NULL,
        Square_Meters FLOAT,
        Open_Date VARCHAR(50) NOT NULL
    )''')
print("Table Created successfully")

Table Created successfully

In [80]:
store_df=pd.read_csv(r"C:\Users\razih\OneDrive\Desktop\New\electronics\store.csv")
store_df.drop(['Unnamed: 0'],axis=1,inplace=True)

In [ ]:
# Inserting data into Store table
insert_query = '''INSERT INTO Store(
            StoreKey ,
            Country,
            State,
            Square_Meters,
            Open_Date
            )
        VALUES(%s, %s, %s, %s, %s)'''
data = store_df.values.tolist()

cursor.executemany(insert_query, data)

connection.commit()

print("Values inserted successfully")

In [81]:
# Creating Table Exchange_Rate
cursor.execute('''CREATE TABLE if not exists Exchange_Rate(
        ID INT AUTO_INCREMENT PRIMARY KEY,
        Record_Date VARCHAR(50) NOT NULL,
        Currency VARCHAR(50) NOT NULL,
        Exchange_Rate FLOAT
    )''')
print("Table Created successfully")

Table Created successfully

In [82]:
ex_df=pd.read_csv(r"C:\Users\razih\OneDrive\Desktop\New\electronics\ex.csv")
ex_df.drop(['Unnamed: 0'],axis=1,inplace=True)

In [ ]:
# Inserting data into Exchange_Rate table
insert_query = '''INSERT INTO Exchange_Rate(
            Record_Date,
            Currency,
            Exchange_Rate
            )
        VALUES(%s, %s, %s)'''
data = ex_df.values.tolist()

cursor.executemany(insert_query, data)

connection.commit()

print("Values inserted successfully")